---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
source: html/f7a0e8ec-6fd5-43e5-1a54-5cb6ebe009c7.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData

Class containing information about section and position of the structural element.

## Syntax (C#)
```csharp
public class StructuralElementDefinitionData : IDisposable
```